{
  "Create PHP File": "Créer un fichier PHP",
  "Enter filename (without .php)": "Entrez le nom du fichier (sans .php)",
  "Enter a name for the new PHP file": "Entrez un nom pour le nouveau fichier PHP",
  
  "Create PHP Class": "Créer une classe PHP",
  "Enter class name": "Entrez le nom de la classe",
  "Enter a name for the new PHP class": "Entrez un nom pour la nouvelle classe PHP",
  
  "Create PHP Interface": "Créer une interface PHP",
  "Enter interface name": "Entrez le nom de l'interface",
  "Enter a name for the new PHP interface": "Entrez un nom pour la nouvelle interface PHP",
  
  "Create PHP Enum": "Créer un enum PHP",
  "Enter enum name": "Entrez le nom de l'enum",
  "Enter a name for the new PHP enum": "Entrez un nom pour le nouvel enum PHP",

  "Create PHP Trait": "Créer un trait PHP",
  "Enter trait name": "Entrez le nom du trait",
  "Enter a name for the new PHP trait": "Entrez un nom pour le nouveau trait PHP",

  "Create Symfony Controller": "Créer un Symfony Controller",
  "Enter controller name": "Entrez le nom du controller",
  "Enter a name for the new Symfony Controller": "Entrez un nom pour le nouveau Symfony Controller",

  "Create Symfony Command": "Créer un Symfony Command",
  "Enter command name": "Entrez le nom du command",
  "Enter a name for the new Symfony Command": "Entrez un nom pour le nouveau Symfony Command",

  "Create Symfony Form": "Créer un Symfony Form",
  "Enter form name": "Entrez le nom du form",
  "Enter a name for the new Symfony Form": "Entrez un nom pour le nouveau Symfony Form",
  
  "Please select a workspace folder": "Veuillez sélectionner un dossier de travail",
  "No target folder selected or no workspace opened.": "Aucun dossier cible sélectionné ou aucun espace de travail ouvert.",
  
  "The file '{0}' already exists. Overwrite?": "Le fichier '{0}' existe déjà. Écraser ?",
  "Overwrite": "Écraser",
  "Cancel": "Annuler",
  "Error creating file: {0}": "Erreur lors de la création du fichier : {0}",
  "Error reading composer.json": "Erreur de lecture du fichier composer.json",

  "Please enter a valid filename": "Veuillez entrer un nom de fichier valide",
  "Filename contains invalid characters": "Le nom du fichier contient des caractères non valides",
  "Please enter a valid definition name": "Veuillez entrer un nom de définition valide",
  "Definition name must start with a letter or underscore": "Le nom de définition doit commencer par une lettre ou un underscore",
  "Definition name must start with an uppercase letter or underscore": "Le nom de définition doit commencer par une lettre majuscule ou un underscore",
  "Definition name can only contain letters, numbers, and underscores": "Le nom de définition ne peut contenir que des lettres, des chiffres et des underscores",
  "Cannot use PHP reserved keyword as definition name": "Impossible d'utiliser un mot-clé réservé PHP comme nom de définition",
  
  "Would you like to update the namespace for \"{0}\" and all its references?": "Souhaitez-vous mettre à jour l'espace de noms pour \"{0}\" et toutes ses références ?",
  "Yes": "Oui",
  "No": "Non",
  "Error during namespace refactoring: {0}": "Erreur lors de la refactorisation de l'espace de noms : {0}",
  "Updating references from \"{0}\" to \"{1}\"": "Mise à jour des références de \"{0}\" vers \"{1}\"",
  "Processing file {0} of {1}": "Traitement du fichier {0} sur {1}",
  "Error updating references in file {0}: {1}": "Erreur lors de la mise à jour des références dans le fichier {0} : {1}",

  "Would you like to update the declaration identifer to \"{0}\" and update its references?": "Souhaitez-vous mettre à jour l'identifiant de déclaration en \"{0}\" et mettre à jour ses références ?",
  "The provided name '{0}' is not a valid PHP identifier. The refactoring process has been canceled.": "Le nom fourni '{0}' n'est pas un identifiant PHP valide. Le processus de refactoring a été annulé.",
  "Unable to locate a valid definition. The refactoring process has been canceled.": "Impossible de localiser une définition valide. Le processus de refactoring a été annulé.",
  "The previous name '{0}' was not a valid PHP identifier. The refactoring process has been canceled.": "Le nom précédent '{0}' n'était pas un identifiant PHP valide. Le processus de refactorisation a été annulé."
}