{
  "Create PHP File": "PHP-Datei erstellen",
  "Enter filename (without .php)": "Dateiname eingeben (ohne .php)",
  "Enter a name for the new PHP file": "Geben Sie einen Namen für die neue PHP-Datei ein",
  
  "Create PHP Class": "PHP-Klasse erstellen",
  "Enter class name": "Klassenname eingeben",
  "Enter a name for the new PHP class": "Geben Sie einen Namen für die neue PHP-Klasse ein",
  
  "Create PHP Interface": "PHP-Interface erstellen",
  "Enter interface name": "Interface-Name eingeben",
  "Enter a name for the new PHP interface": "Geben Sie einen Namen für das neue PHP-Interface ein",
  
  "Create PHP Enum": "PHP-Enum erstellen",
  "Enter enum name": "Enum-Name eingeben",
  "Enter a name for the new PHP enum": "Geben Sie einen Namen für den neuen PHP-Enum ein",
  
  "Create PHP Trait": "PHP-Trait erstellen",
  "Enter trait name": "Trait-Name eingeben",
  "Enter a name for the new PHP trait": "Geben Sie einen Namen für den neuen PHP-Trait ein",
  
  "Please select a workspace folder": "Bitte wählen Sie einen Arbeitsbereichsordner aus",
  "No target folder selected or no workspace opened.": "Kein Zielordner ausgewählt oder kein Arbeitsbereich geöffnet.",
  
  "The file '{0}' already exists. Overwrite?": "Die Datei '{0}' existiert bereits. Überschreiben?",
  "Overwrite": "Überschreiben",
  "Cancel": "Abbrechen",
  "Error creating file: {0}": "Fehler beim Erstellen der Datei: {0}",
  "Error reading composer.json": "Fehler beim Lesen der composer.json",

  "Please enter a valid filename": "Bitte geben Sie einen gültigen Dateinamen ein",
  "Filename contains invalid characters": "Der Dateiname enthält ungültige Zeichen",
  "Please enter a valid definition name": "Bitte geben Sie einen gültigen Definitionsnamen ein",
  "Definition name must start with a letter or underscore": "Der Definitionsname muss mit einem Buchstaben oder einem Unterstrich beginnen",
  "Definition name must start with an uppercase letter or underscore": "Der Definitionsname muss mit einem Großbuchstaben oder einem Unterstrich beginnen",
  "Definition name can only contain letters, numbers, and underscores": "Der Definitionsname darf nur Buchstaben, Zahlen und Unterstriche enthalten",
  "Cannot use PHP reserved keyword as definition name": "PHP-reservierte Schlüsselwörter können nicht als Definitionsnamen verwendet werden"
}