{
  "Create PHP File": "Crear archivo PHP",
  "Enter filename (without .php)": "Ingrese nombre de archivo (sin .php)",
  "Enter a name for the new PHP file": "Ingrese un nombre para el nuevo archivo PHP",
  
  "Create PHP Class": "Crear clase PHP",
  "Enter class name": "Ingrese nombre de la clase",
  "Enter a name for the new PHP class": "Ingrese un nombre para la nueva clase PHP",
  
  "Create PHP Interface": "Crear interfaz PHP",
  "Enter interface name": "Ingrese nombre de la interfaz",
  "Enter a name for the new PHP interface": "Ingrese un nombre para la nueva interfaz PHP",
  
  "Create PHP Enum": "Crear enum PHP",
  "Enter enum name": "Ingrese nombre del enum",
  "Enter a name for the new PHP enum": "Ingrese un nombre para el nuevo enum PHP",
  
  "Create PHP Trait": "Crear trait PHP",
  "Enter trait name": "Ingrese nombre del trait",
  "Enter a name for the new PHP trait": "Ingrese un nombre para el nuevo trait PHP",

  "Create Symfony Controller": "Crear Symfony Controller",
  "Enter controller name": "Ingrese nombre del controller",
  "Enter a name for the new Symfony Controller": "Ingrese un nombre para el nuevo Symfony Controller",

  "Create Symfony Command": "Crear Symfony Command",
  "Enter command name": "Ingrese nombre del command",
  "Enter a name for the new Symfony Command": "Ingrese un nombre para el nuevo Symfony Command",

  "Create Symfony Form": "Crear Symfony Form",
  "Enter form name": "Ingrese nombre del form",
  "Enter a name for the new Symfony Form": "Ingrese un nombre para el nuevo Symfony Form",
  
  "Please select a workspace folder": "Por favor seleccione una carpeta de trabajo",
  "No target folder selected or no workspace opened.": "No se ha seleccionado una carpeta de destino o no hay un espacio de trabajo abierto.",
  
  "The file '{0}' already exists. Overwrite?": "El archivo '{0}' ya existe. ¿Sobrescribir?",
  "Overwrite": "Sobrescribir",
  "Cancel": "Cancelar",
  "Error creating file: {0}": "Error al crear el archivo: {0}",
  "Error reading composer.json": "Error al leer composer.json",
  
  "Please enter a valid filename": "Por favor ingrese un nombre de archivo válido",
  "Filename contains characters not allowed by the file system": "El nombre del archivo contiene caracteres no permitidos por el sistema de archivos",
  "Filename contains characters that may cause issues with PHP includes or URLs": "El nombre del archivo contiene caracteres que pueden causar problemas con includes de PHP o URLs",
  "Namespace skipped: The detected namespace was invalid due to invalid names in the directory structure.": "Espacio de nombres omitido: El espacio de nombres detectado no era válido debido a nombres no válidos en la estructura de directorios.",
  
  "Please enter a valid definition name": "Por favor ingrese un nombre de definición válido",
  "Definition name must start with a letter or underscore": "El nombre de definición debe comenzar con una letra o guion bajo",
  "Definition name must start with an uppercase letter or underscore": "El nombre de definición debe comenzar con una letra mayúscula o guion bajo",
  "Definition name can only contain letters, numbers, and underscores": "El nombre de definición solo puede contener letras, números y guiones bajos",
  "Cannot use PHP reserved keyword as definition name": "No se puede usar una palabra reservada de PHP como nombre de definición",
  
  "Would you like to update the namespace for \"{0}\" and all its references?": "¿Le gustaría actualizar el espacio de nombres para \"{0}\" y todas sus referencias?",
  "Yes": "Sí",
  "No": "No",
  "Error during namespace refactoring: {0}": "Error durante la refactorización del espacio de nombres: {0}",
  "Updating references from \"{0}\" to \"{1}\"": "Actualizando referencias de \"{0}\" a \"{1}\"",
  "Processing file {0} of {1}": "Procesando archivo {0} de {1}",
  "Error updating references in file {0}: {1}": "Error al actualizar referencias en el archivo {0}: {1}",

  "Would you like to update the declaration identifer to \"{0}\" and update its references?": "¿Le gustaría actualizar el identificador de declaración a \"{0}\" y actualizar sus referencias?",
  "The provided name '{0}' is not a valid PHP identifier. The refactoring process has been canceled.": "El nombre proporcionado '{0}' no es un identificador PHP válido. El proceso de refactorización ha sido cancelado.",
  "The previous name '{0}' was not a valid PHP identifier. The refactoring process has been canceled.": "El nombre anterior '{0}' no era un identificador PHP válido. El proceso de refactorización ha sido cancelado.",
  "Unable to locate a valid definition. The refactoring process has been canceled.": "No se puede localizar una definición válida. El proceso de refactorización ha sido cancelado.",

  "Would you like to update all files and their references for directory \"{0}\"? This operation may take some time depending on the directory content and project size.": "¿Le gustaría actualizar todos los archivos y sus referencias para el directorio \"{0}\"? Esta operación puede tomar algún tiempo dependiendo del contenido del directorio y el tamaño del proyecto."
}